In [1]:
import pandas as pd
import numpy as np

In [2]:
cc = pd.read_csv('cc.csv')
demo = pd.read_csv('demographics.csv')
kplus = pd.read_csv('kplus.csv')

In [3]:
# rename cc columns name
cc.columns = ['cc_no','date','spend_amount']
cc.head()

   cc_no        date  spend_amount
0  37069  2018-05-10          5000
1  37069  2018-06-04         12000
2  37069  2018-04-03          5000
3  37069  2018-04-22          1600
4  37069  2018-01-21          5000

In [4]:
# rename demo columns name
demo.columns = ['id','cc_no','gender','occupation','age']
demo.head()

   id  cc_no  gender  occupation  age
0   1      1       2         9.0    5
1   1  98397       2         9.0    5
2   2      2       2         3.0    4
3   2   9740       2         3.0    4
4   3      3       2         1.0    3

In [5]:
# rename kplus columns name
kplus.columns = ['id','week','count/week','spend/week']
kplus.head()

      id        week  count/week  spend/week
0  14802  2018-01-14           2        2400
1  14802  2018-04-01           9       33900
2  14802  2018-05-27           7        6100
3  14802  2018-01-28           3        8500
4  14802  2018-03-25           2        4000

In [6]:
# check data type

print(cc.dtypes)
print(demo.dtypes)
kplus.dtypes

cc_no            int64
date            object
spend_amount     int64
dtype: object
id              int64
cc_no           int64
gender          int64
occupation    float64
age             int64
dtype: object

id             int64
week          object
count/week     int64
spend/week     int64
dtype: object

In [7]:
# change data types

cc.date = cc.date.astype('datetime64[ns]')
demo.gender = demo.gender.astype('category')
demo.occupation = demo.occupation.astype('category')
demo.age = demo.age.astype('category')
kplus.week = kplus.week.astype('datetime64[ns]')

In [8]:
# check data type

print(cc.dtypes)
print(demo.dtypes)
kplus.dtypes

cc_no                    int64
date            datetime64[ns]
spend_amount             int64
dtype: object
id               int64
cc_no            int64
gender        category
occupation    category
age           category
dtype: object

id                     int64
week          datetime64[ns]
count/week             int64
spend/week             int64
dtype: object